Revit 2027 API
ParameterTypeId.RebarShapeTypeAtEnd Property
 "Type At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeTypeAtEnd { get; }
Public Shared ReadOnly Property RebarShapeTypeAtEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeTypeAtEnd {
	ForgeTypeId^ get ();
}
static member RebarShapeTypeAtEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace